# BigInteger - Тип для больших целых чисел int.
#
# Boolean - Тип данных для булевых значений bool.
#
# Date - Тип для объектов datetime.date().
#
# DateTime - Тип для объектов datetime.datetime().
#
# Double - Тип для чисел с плавающей точкой двойной точности FLOAT.
#
# Enum - Общий тип для перечислений Enum.
#
# Float - Тип, представляющий числа с плавающей точкой, такие как FLOAT или REAL.
#
# Integer - Тип для целых чисел int.
#
# Interval - Тип для объектов datetime.timedelta().
#
# LargeBinary - Тип для больших бинарных данных.
#
# MatchType - Относится к возвращаемому типу оператора MATCH.
#
# Numeric - Базовый тип для нецелочисленных числовых типов, таких как NUMERIC, FLOAT, DECIMAL и их варианты.
#
# PickleType - Хранит объекты Python, которые сериализуются с помощью pickle.
#
# SchemaType - Добавляет возможности типу, позволяющие ассоциировать DDL на уровне схемы с типом.
#
# SmallInteger - Тип для меньших целых чисел int.
#
# String - Базовый тип для всех строковых и символьных типов.
#
# Text - Строковый тип переменной длины.
#
# Time - Тип для объектов datetime.time().
#
# Unicode - Строковый тип переменной длины для Unicode.
#
# UnicodeText - Строковый тип неограниченной длины для Unicode.
#
# Uuid - Представляет универсальный тип данных UUID, независимый от базы данных.